export default {

	vertices: [
		[0, 234, 106], // Казино
		[20, 245, 77], // Вход в казино сверху
		[21, 162, 115], // Вход в казино сбоку
		[1, 158.7, 38], // Elev 1
		[2, 202.75, 43], // Бутик
		[30, 202.75, 66], // Вход в бутик
		[3, 292.25, 43], // Ресторан
		[40, 292.25, 66], // Вход в ресторан
		// Магазины
		[4, 108.5, 43],
		[50, 108.5, 66],
		[5, 49.5, 43],
		[51, 49.5, 66],
		[6, 49.5, 108],
		[52, 49.5, 85],
		[7, 108.5, 108],
		[53, 108.5, 85],
		// Коридоры
		[60, 163, 71.5],
		[61, 140, 75.5],
		[62, 17, 75.5],
		// Лестницы
		[11, 161, 94], // Лестница 11
		[15, 150, 94], // Подъем на лестницу 11
		[12, 160, 145], // Лестница 12
		[16, 160, 134], // Подъем на лестницу 12
		[13, 15, 10], // Лестница 13
		[17, 15, 25], // Подъем на лестницу 13
		[14, 15, 140], // Лестница 14
		[18, 15, 125], // Подъем на лестницу 14
	].map(([id, x, y]) => ({ id, x, y })),

	edges: [
		// Казино
		[20, 0],
		[20, 60],
		[20, 30],
		[20, 40],
		[21, 0],
		[21, 15],
		[21, 16],
		// Лифт
		[1, 60],
		[1, 61],
		[1, 15],
		// Бутик
		[30, 2],
		[30, 60],
		// Ресторан
		[40, 3],
		[40, 60],
		[40, 30],
		// Магазины
		[50, 4],
		[50, 61],
		[50, 62],
		[51, 5],
		[51, 61],
		[51, 62],
		[51, 50],
		[52, 6],
		[52, 61],
		[52, 62],
		[52, 50],
		[52, 51],
		[53, 7],
		[53, 61],
		[53, 62],
		[53, 50],
		[53, 51],
		[53, 52],
		// Коридоры
		[60, 61],
		[61, 62],
		// Лестница 11
		[15, 11],
		[15, 1],
		[15, 60],
		[15, 61],
		[15, 16],
		// Лестница 12
		[16, 12],
		// Лестница 13
		[17, 13],
		[17, 62],
		// Лестница 14
		[18, 14],
		[18, 62],
		[18, 17],
	].map(([from, to]) => ({ from, to })),

	excludedVertexIds: new Set(
		new Array(84).fill().map((_, index) => 15 + index)
	),

};