export default {

	vertices: [
		[0, 211, 38], // Тренажерный зал
		[30, 163.5, 26.25], // Вход в тренажерный зал снаружи
		[31, 169.5, 26.25], // Вход в тренажерный зал изнутри
		[1, 158.7, 38], // Elev 1
		[20, 147.7, 38], // Точка перехода к лифту 1
		[21, 147.7, 30], // Точка перехода к лифту 2
		[2, 221, 93], // Фитнес-центр
		[40, 172, 117.6], // Вход в фитнес-центр снаружи
		[41, 178, 117.6], // Вход в фитнес-центр изнутри
		[42, 243, 60.5], // Проход из тренажерного зала в фитнес-центр
		[5, 101, 39], // Верхний джакузи
		[50, 130, 39], // Верхняя правая точка бассейна
		[3, 130, 75], // Бассейн справа
		[51, 130, 110], // Нижняя правая точка бассейна
		[6, 101, 110], // Нижний джакузи
		[52, 78, 110], // Нижняя левая точка бассейна
		[4, 78, 75], // Бассейн слева
		[53, 78, 39], // Верхняя левая точка бассейна
		// Солярий
		[7, 54.5, 39],
		[8, 38.5, 39],
		[9, 38.5, 110],
		[10, 54.5, 110],
		// Лестницы
		[11, 160, 145], // Лестница 11
		[15, 160, 134], // Подъем на лестницу 11
		[12, 15, 10], // Лестница 12
		[16, 15, 25], // Подъем на лестницу 12
		[13, 15, 140], // Лестница 13
		[17, 15, 125], // Подъем на лестницу 13
	].map(([id, x, y]) => ({ id, x, y })),

	edges: [
		// Лифт
		[1, 20],
		[20, 21],
		// Тренажерный зал
		[0, 42],
		[31, 0],
		[31, 42],
		[30, 31],
		[30, 21],
		// Фитнес-центр
		[2, 42],
		[41, 2],
		[41, 42],
		[40, 41],
		[40, 1],
		[40, 20],
		[40, 50],
		[40, 3],
		[40, 51],
		[40, 6],
		// Бассейн и джакузи
		[5, 50],
		[5, 1],
		[5, 20],
		[5, 21],
		[50, 3],
		[50, 1],
		[50, 20],
		[50, 21],
		[3, 51],
		[3, 1],
		[3, 20],
		[3, 21],
		[51, 6],
		[51, 1],
		[51, 20],
		[51, 21],
		[6, 52],
		[52, 4],
		[4, 53],
		[53, 5],
		// Солярий
		[7, 8],
		[7, 9],
		[7, 10],
		[7, 5],
		[7, 50],
		[7, 52],
		[7, 4],
		[7, 53],
		[8, 9],
		[8, 10],
		[8, 5],
		[8, 50],
		[8, 52],
		[8, 4],
		[8, 53],
		[9, 10],
		[9, 51],
		[9, 6],
		[9, 52],
		[9, 4],
		[9, 53],
		[10, 51],
		[10, 6],
		[10, 52],
		[10, 4],
		[10, 53],
		// Лестница 11
		[15, 11],
		[15, 1],
		[15, 40],
		[15, 50],
		[15, 3],
		[15, 51],
		[15, 6],
		// Лестница 12
		[16, 12],
		[16, 8],
		// Лестница 13
		[17, 13],
		[17, 9],
		[17, 16],
	].map(([from, to]) => ({ from, to })),

	excludedVertexIds: new Set(
		new Array(84).fill().map((_, index) => 15 + index)
	),

};